#Область СлужебныеПроцедурыИФункции
Функция ГенерацияСлучайнойСтрокиИзЦифр() Экспорт
	ГенераторСЧ = Новый ГенераторСлучайныхЧисел();
	Строка = "";
	
	Для СЧ = 1 По 6 Цикл
		Строка = Строка + ГенераторСЧ.СлучайноеЧисло(0,9);
	КонецЦикла;
	
	Возврат Строка;
КонецФункции

Функция ГенерацияСлучайнойСтроки() Экспорт
	ГенераторСЧ = Новый ГенераторСлучайныхЧисел();
	Строка = "";
	
	Для СЧ = 1 По 6 Цикл
		Набор = ГенераторСЧ.СлучайноеЧисло(1,3);
		Если Набор = 1 Тогда
			СлучайныйСимвол = ГенераторСЧ.СлучайноеЧисло(1,9);
		ИначеЕсли Набор = 2 Тогда
			СлучайныйСимвол = Символ(ГенераторСч.СлучайноеЧисло(65,90));
		Иначе
			СлучайныйСимвол = Символ(ГенераторСч.СлучайноеЧисло(97,122));
		КонецЕсли;
		Строка = Строка + СлучайныйСимвол;
	КонецЦикла;
	Возврат Строка;
КонецФункции
#КонецОбласти